autocore-ai/pcu_mcu_hal/LaunchPad_FreeRTOS_g/FreeRTOS-Plus-IO/Device/tms570ls20x31x/source/tms570ls20x31x_uart.c
/*
 * FreeRTOS+IO V1.0.1 (C) 2012 Real Time Engineers ltd.
 *
 * FreeRTOS+IO is an add-on component to FreeRTOS.  It is not, in itself, part 
 * of the FreeRTOS kernel.  FreeRTOS+IO is licensed separately from FreeRTOS, 
 * and uses a different license to FreeRTOS.  FreeRTOS+IO uses a dual license
 * model, information on which is provided below:
 *
 * - Open source licensing -
 * FreeRTOS+IO is a free download and may be used, modified and distributed
 * without charge provided the user adheres to version two of the GNU General
 * Public license (GPL) and does not remove the copyright notice or this text.
 * The GPL V2 text is available on the gnu.org web site, and on the following
 * URL: http://www.FreeRTOS.org/gpl-2.0.txt
 *
 * - Commercial licensing -
 * Businesses and individuals who wish to incorporate FreeRTOS+IO into
 * proprietary software for redistribution in any form must first obtain a low
 * cost commercial license - and in-so-doing support the maintenance, support
 * and further development of the FreeRTOS+IO product.  Commercial licenses can
 * be obtained from http://shop.freertos.org and do not require any source files
 * to be changed.
 *
 * FreeRTOS+IO is distributed in the hope that it will be useful.  You cannot
 * use FreeRTOS+IO unless you agree that you use the software 'as is'.
 * FreeRTOS+IO is provided WITHOUT ANY WARRANTY; without even the implied
 * warranties of NON-INFRINGEMENT, MERCHANTABILITY or FITNESS FOR A PARTICULAR
 * PURPOSE. Real Time Engineers Ltd. disclaims all conditions and terms, be they
 * implied, expressed, or statutory.
 *
 * 1 tab == 4 spaces!
 *
 * http://www.FreeRTOS.org
 * http://www.FreeRTOS.org/FreeRTOS-Plus
 *
 */

/* Modified for Texas Instruments TMS570LS20X and TMS570LS31X microcontroller family.
 * FreeRTOS-Plus-IO - UART TMS570LS20X31X V0.0.2  (C) 2014 Lovas Szilárd
 * Email: lovas.szilard@gmail.com
 */

/**
* @file tms570ls20x31x_uart.c
*   @brief FreeRTOS-Plus-IO Uart Driver Implmentation File
*   @date 12.Aug.2014
*   @version 00.00.02  sciREG4
*
*/

/* FreeRTOS includes. */
#include "FreeRTOS.h"
#include "os_task.h"
#include "os_semphr.h"

/* FreeRTOS+IO includes. */
#include "FreeRTOS_IO.h"
#include "FreeRTOSIOConfig.h"
#include "IOUtils_Common.h"
#include "FreeRTOS_uart.h"

#include "tms570ls20x31x_uart.h"
#include "tms570ls20x31x_dma.h"

/* HALCoGen generated header files. */
#include "HL_sci.h"
#include "HL_sys_dma.h"
#include "HL_sys_vim.h"

#include "sys_main.h"

/* HALCoGen generated sci API. */
//#include <HL_sci.c>

/* Stores the transfer control structures that are currently in use by the
supported UART ports. */
Transfer_Control_t *pxUartTxTransferControlStructs[ boardNUM_UARTS ] = { NULL };
Transfer_Control_t *pxUartRxTransferControlStructs[ boardNUM_UARTS ] = { NULL };

/* Stores the DMA channels that are currently in use by the supported UART ports. */
uint8_t xUartTX_DMA_Channels[ boardNUM_UARTS ] = { 0xff };

/*-----------------------------------------------------------*/
/**
 * @fn portBASE_TYPE FreeRTOS_UART_open( Peripheral_Control_t * const pxPeripheralControl )
 * @param pxPeripheralControl
 * @return
 */
portBASE_TYPE FreeRTOS_UART_open( Peripheral_Control_t * const pxPeripheralControl )
{
	portBASE_TYPE xReturn;
	const uint8_t cPeripheralNumber = diGET_PERIPHERAL_NUMBER( pxPeripheralControl );
	sciBASE_t * const pxUART = ( sciBASE_t *) diGET_PERIPHERAL_BASE_ADDRESS( ( ( Peripheral_Control_t *) pxPeripheralControl ) );


	/* Sanity check the peripheral number. */
	if( cPeripheralNumber < boardNUM_UARTS )
	{
		pxPeripheralControl->read = FreeRTOS_UART_read;
		pxPeripheralControl->write = FreeRTOS_UART_write;
		pxPeripheralControl->ioctl = FreeRTOS_UART_ioctl;

		/* Setup the pins for the UART being used. */
		taskENTER_CRITICAL();
		{
			/* SCI setup related functions..  */
			sciSetBaudrate(pxUART, boardDEFAULT_UART_BAUD);

			/* Switch to the FreeRTOS-Plus-IO compatibility API mode. */
			configASSERT(xFreeRTOSsciInit(pxUART));
		}
		taskEXIT_CRITICAL();

		xReturn = pdPASS;
	}
	else
	{
		xReturn = pdFAIL;
	}

	return xReturn;
}
/*-----------------------------------------------------------*/
/**
 * @fn size_t FreeRTOS_UART_write( Peripheral_Descriptor_t const pxPeripheral, const void *pvBuffer, const size_t xBytes )
 * @param pxPeripheral
 * @param pvBuffer
 * @param xBytes
 * @return
 */
size_t FreeRTOS_UART_write( Peripheral_Descriptor_t const pxPeripheral, const void *pvBuffer, const size_t xBytes )
{
	volatile Peripheral_Control_t * const pxPeripheralControl = ( Peripheral_Control_t * ) pxPeripheral;
	sciBASE_t * const pxUART = ( sciBASE_t * ) diGET_PERIPHERAL_BASE_ADDRESS( ( ( Peripheral_Control_t * ) pxPeripheral ) );
	size_t xReturn = 0U;
	portBASE_TYPE i;

	/* Remember which transfer control structure is being used.
	The Tx interrupt will use this to continue to write data to the
	Tx FIFO/UART until the length member of the structure reaches
	zero. */

	int8_t cPeripheralNumber;
	cPeripheralNumber = diGET_PERIPHERAL_NUMBER( pxPeripheralControl );
	pxUartTxTransferControlStructs[ cPeripheralNumber  ] = diGET_TX_TRANSFER_STRUCT( pxPeripheralControl );

	if( diGET_TX_TRANSFER_STRUCT( pxPeripheralControl ) == NULL )
	{
		#if ioconfigUSE_UART_POLLED_TX == 1
		{
			/* No FreeRTOS objects exist to allow transmission without blocking
			the	task, so just send out by polling.  No semaphore or queue is
			used here, so the application must ensure only one task attempts to
			make a polling write at a time. */
			for(i=0;i<xBytes;i++)sciSendByte(pxUART, *((uint8*)pvBuffer+i));
		}
		#endif /* ioconfigUSE_UART_POLLED_TX */
	}

	else
	{
		/* Remember which transfer control structure is being used.
		The Tx interrupt will use this to continue to write data to the
		Tx FIFO/UART until the length member of the structure reaches
		zero. */
		cPeripheralNumber = diGET_PERIPHERAL_NUMBER( pxPeripheralControl );
		pxUartTxTransferControlStructs[ cPeripheralNumber  ] = diGET_TX_TRANSFER_STRUCT( pxPeripheralControl );

		switch( diGET_TX_TRANSFER_TYPE( pxPeripheralControl ) )
		{
			case ioctlUSE_ZERO_COPY_TX :

