autocore-ai/pcu_mcu_hal/LaunchPad_FreeRTOS_g/FreeRTOS-Plus-IO/Device/tms570ls20x31x/source/tms570ls20x31x_uart.c
				#if ioconfigUSE_UART_ZERO_COPY_TX == 1
				{
					/* The implementation of the zero copy write uses a semaphore
					to indicate whether a write is complete (and so the buffer
					being written free again) or not.  The semantics of using a
					zero copy write dictate that a zero copy write can only be
					attempted by a task, once the semaphore has been successfully
					obtained by that task.  This ensure that only one task can
					perform a zero copy write at any one time.  Ensure the semaphore
					is not currently available, if this function has been called
					without it being obtained first then it is an error. */
					configASSERT( xIOUtilsGetZeroCopyWriteMutex( pxPeripheralControl, ioctlOBTAIN_WRITE_MUTEX, 0U ) == pdFALSE );

					Zero_Copy_Tx_State_t * volatile pxZeroCopyState = pxPeripheralControl->pxTxControl->pvTransferState;

					if( xSemaphoreGetMutexHolder( pxZeroCopyState->xWriteAccessMutex ) == xTaskGetCurrentTaskHandle() )
					{
						/* Sends the first to the peripheral. */
						pxUART->TD = *((uint8*)pvBuffer);
						/* Configure the Tx structure to send whatever has not already been	sent to the FIFO. */
						pxZeroCopyState->pucBufferStart = ( uint8_t * ) (pvBuffer);
						pxZeroCopyState->pucBufferStart++;
						pxZeroCopyState->usBufferLength = ( uint16_t ) (xBytes);
						pxZeroCopyState->usBufferLength--;
						/* Enable peripheral interrupt.  */
						pxUART->SETINT = SCI_TX_INT;
						xReturn = xBytes;
					}
					else
					{
						xReturn = 0U;
					}
				}
				#else
				configASSERT(0);
				#endif /* ioconfigUSE_UART_ZERO_COPY_TX */
				break;

			case ioctlUSE_ZERO_COPY_TX_DMA :

				#if ioconfigUSE_UART_ZERO_COPY_TX_DMA == 1
				{
					/* The implementation of the zero copy write uses a semaphore
					to indicate whether a write is complete (and so the buffer
					being written free again) or not.  The semantics of using a
					zero copy write dictate that a zero copy write can only be
					attempted by a task, once the semaphore has been successfully
					obtained by that task.  This ensure that only one task can
					perform a zero copy write at any one time.  Ensure the semaphore
					is not currently available, if this function has been called
					without it being obtained first then it is an error. */

					configASSERT( xIOUtilsGetZeroCopyWriteMutex( pxPeripheralControl, ioctlOBTAIN_WRITE_MUTEX, 0U ) == 0 );
					Zero_Copy_Tx_State_t * pxZeroCopyState = pxPeripheralControl->pxTxControl->pvTransferState;
					g_dmaCTRL xDMA_CtrlPacket;

					if( xSemaphoreGetMutexHolder( pxZeroCopyState->xWriteAccessMutex ) == xTaskGetCurrentTaskHandle() )
					{

						/* Configure DMA Control packet for transmission */
						xDMA_CtrlPacket.SADD      = (uint32)pvBuffer;				/* source address				*/

						#ifdef _little_endian__
						xDMA_CtrlPacket.DADD	  = (uint32_t)(&(pxUART->TD)); 		/* destination address			*/
						#else
						xDMA_CtrlPacket.DADD	  = (uint32_t)(&(pxUART->TD))+3; 	/* destination address			*/
						#endif
						xDMA_CtrlPacket.CHCTRL    = 0;                 				/* channel control 				*/

						if(xBytes < maxUART_DMA_BlockSize)
						{
							xDMA_CtrlPacket.FRCNT = xBytes;           				/* frame count 					*/
							pxZeroCopyState->usBufferLength = 0;
						}
						else
							{
							xDMA_CtrlPacket.FRCNT = maxUART_DMA_BlockSize;      	/* frame count 					*/
							pxZeroCopyState->usBufferLength = xBytes - maxUART_DMA_BlockSize;
							}

						xDMA_CtrlPacket.ELCNT     = 1;                 				/* element count 				*/
						xDMA_CtrlPacket.ELDOFFSET = 0;                 				/* element destination offset 	*/
						xDMA_CtrlPacket.ELSOFFSET = 0;                 				/* element source offset 		*/
						xDMA_CtrlPacket.FRDOFFSET = 0;                 				/* frame destination offset 	*/
						xDMA_CtrlPacket.FRSOFFSET = 0;                 				/* frame source offset 			*/
						xDMA_CtrlPacket.PORTASGN  = 4;                 				/* port b 						*/
					    xDMA_CtrlPacket.RDSIZE    = ACCESS_8_BIT;     				/* read size 					*/
						xDMA_CtrlPacket.WRSIZE    = ACCESS_8_BIT;     				/* write size 					*/
						xDMA_CtrlPacket.TTYPE     = FRAME_TRANSFER ;   				/* transfer type 				*/
						xDMA_CtrlPacket.ADDMODERD = ADDR_INC1;         				/* address mode read 			*/
						xDMA_CtrlPacket.ADDMODEWR = ADDR_FIXED;        				/* address mode write 			*/
					    xDMA_CtrlPacket.AUTOINIT  = AUTOINIT_OFF;      				/* autoinit						*/

						/* - setting dma control packets for transmit */
						dmaSetCtrlPacket((dmaChannel_t )xUartTX_DMA_Channels[cPeripheralNumber],xDMA_CtrlPacket);

						/* Wait for SCI device is ready for TX */
						while ((pxUART->FLR & SCI_TX_INT) == 0U);

						/* SCI_ENABLE_TX_DMA_MODE */
						pxUART->SETINT=(1U<<16U);

						/* Start DMA transfer */
						dmaSetChEnable((dmaChannel_t)xUartTX_DMA_Channels[cPeripheralNumber], DMA_SW);
						if(xBytes > 1)dmaSetChEnable((dmaChannel_t)xUartTX_DMA_Channels[cPeripheralNumber], DMA_HW);

						xReturn = xBytes;
					}
					else
					{
						xReturn = 0U;
					}
				}
				#else
				configASSERT(0);
				#endif /* ioconfigUSE_UART_ZERO_COPY_TX_DMA */
				break;

			case ioctlUSE_CHARACTER_QUEUE_TX :

				#if ioconfigUSE_UART_TX_CHAR_QUEUE == 1
				{
					/* The queue allows multiple tasks to attempt to write
					bytes, but ensures only the highest priority of these tasks
					will actually succeed.  If two tasks of equal priority
					attempt to write simultaneously, then the application must
					ensure mutual exclusion, as time slicing could result in
					the strings being sent to the queue being interleaved. */

					portTickType xTicksToWait;
					uint8_t ucChar;
					xTimeOutType xTimeOut;
					Character_Queue_State_t *pxTxState = prvTX_CHAR_QUEUE_STATE( pxPeripheralControl );
					xQueueHandle xQueue;

					xTicksToWait = pxTxState->xBlockTime;
					xQueue = pxTxState->xQueue;
					vTaskSetTimeOutState( &xTimeOut );

					for( ( xReturn ) = 0U; ( xReturn ) < ( xBytes ); ( xReturn )++ )
					{
						if( xQueueSend( xQueue, &( ( ( uint8_t * ) pvBuffer )[ ( xReturn ) ] ), xTicksToWait ) != pdPASS )
						{
							break;
						}
						else
						{
							/* If this task is low priority it is possible that it only
							gets intermittent CPU time, and therefore possible that the
							peripheral interrupt has drained the Tx queue before this point is
							reached.  If this is the case, and the queue contains more
							data, then force the peripheral ISR to be re-entered. */
							if( (pxUART->FLR & SCI_TX_INT) )
							{
								if( xQueueReceive( xQueue, &ucChar, xTicksToWait ) == pdPASS )
								{
									/* Sends the first to the peripheral. */
									pxUART->TD = ucChar;
									pxUART->SETINT = SCI_TX_INT;
								}
							}
						}

						if( xTaskCheckForTimeOut( &xTimeOut, &xTicksToWait ) != pdFALSE )
						{
							/* Time out has expired. */
							break;
						}
					}
				}
				#else
					configASSERT(0);
				#endif /* ioconfigUSE_UART_TX_CHAR_QUEUE */
				break;

			default :

				/* Other methods can be implemented here.  For now set the
				stored transfer structure back to NULL as nothing is being
				sent. */
				configASSERT( xReturn );
				pxUartTxTransferControlStructs[ cPeripheralNumber ] = NULL;

