autocore-ai/pcu_mcu_hal/LaunchPad_FreeRTOS_g/FreeRTOS-Plus-IO/Device/tms570ls20x31x/source/tms570ls20x31x_uart.c
				/* Prevent compiler warnings when the configuration is set such
				that the following parameters are not used. */
				( void ) pvBuffer;
				( void ) xBytes;
				( void ) pxUART;
				break;
		}
	}
	return xReturn;
}
/*-----------------------------------------------------------*/

/**
 * @fn size_t FreeRTOS_UART_read( Peripheral_Descriptor_t const pxPeripheral, void * const pvBuffer, const size_t xBytes )
 * @param pxPeripheral
 * @param pvBuffer
 * @param xBytes
 * @return
 */
size_t FreeRTOS_UART_read( Peripheral_Descriptor_t const pxPeripheral, void * const pvBuffer, const size_t xBytes )
{
	Peripheral_Control_t * const pxPeripheralControl = ( Peripheral_Control_t * ) pxPeripheral;
	sciBASE_t * const pxUART = ( sciBASE_t * ) diGET_PERIPHERAL_BASE_ADDRESS( ( ( Peripheral_Control_t * ) pxPeripheral ) );

	size_t xReturn = 0U;
	size_t xBytesCounter = xBytes;
	uint8_t *pCharBuffer = pvBuffer;


	if( diGET_RX_TRANSFER_STRUCT( pxPeripheralControl ) == NULL )
	{
		#if ioconfigUSE_UART_POLLED_RX == 1
		{
			/* No FreeRTOS objects exist to allow reception without blocking
			the task, so just receive by polling.  No semaphore or queue is
			used here, so the application must ensure only one task attempts
			to make a polling read at a time. */

			while(xBytesCounter)
			{
				if(sciIsRxReady(pxUART))
				{
					(*pCharBuffer++) = sciReceiveByte(pxUART);
					xReturn++;
					xBytesCounter--;
				}
			}
		}
		#endif /* ioconfigUSE_UART_POLLED_RX */
	}
	else
	{
		/* Sanity check the array index. */
		//configASSERT( diGET_PERIPHERAL_NUMBER( pxPeripheralControl ) < ( int8_t ) ( sizeof( xIRQ ) / sizeof( IRQn_Type ) ) );

		switch( diGET_RX_TRANSFER_TYPE( pxPeripheralControl ) )
		{
			case ioctlUSE_CIRCULAR_BUFFER_RX :

				#if ioconfigUSE_UART_CIRCULAR_BUFFER_RX == 1
				{
					/* There is nothing to prevent multiple tasks attempting to
					read the circular buffer at any one time.  The implementation
					of the circular buffer uses a semaphore to indicate when new
					data is available, and the semaphore will ensure that only the
					highest priority task that is attempting a read will actually
					receive bytes. */

					ioutilsRECEIVE_CHARS_FROM_CIRCULAR_BUFFER
						(
							pxPeripheralControl,
							sciDisableNotification(pxUART,SCI_RX_INT),			/* Disable peripheral. */
							sciEnableNotification(pxUART,SCI_RX_INT), 			/* Enable peripheral. */
							( ( uint8_t * ) pvBuffer ),							/* Data destination. */
							xBytes,												/* Bytes to read. */
							xReturn												/* Number of bytes read. */
						);

				}
				#else
				configASSERT(0);
				#endif /* ioconfigUSE_UART_CIRCULAR_BUFFER_RX */
				break;


			case ioctlUSE_CHARACTER_QUEUE_RX :

				#if ioconfigUSE_UART_RX_CHAR_QUEUE == 1
				{
					/* The queue allows multiple tasks to attempt to read
					bytes, but ensures only the highest priority of these
					tasks will actually receive bytes.  If two tasks of equal
					priority attempt to read simultaneously, then the
					application must ensure mutual exclusion, as time slicing
					could result in the string being received being partially
					received by each task. */
					xReturn = xIOUtilsReceiveCharsFromRxQueue( pxPeripheralControl, ( uint8_t * ) pvBuffer, xBytes );

				}
				#else
				configASSERT(0);
				#endif /* ioconfigUSE_UART_RX_CHAR_QUEUE */
				break;


			default :

				/* Other methods can be implemented here. */
				configASSERT( xReturn );

				/* Prevent compiler warnings when the configuration is set such
				that the following parameters are not used. */
				( void ) pvBuffer;
				( void ) xBytes;
				( void ) pxUART;
				break;
		}
	}
	return xReturn;
}
/*-----------------------------------------------------------*/

/**
 * @fn portBASE_TYPE FreeRTOS_UART_ioctl( Peripheral_Descriptor_t pxPeripheral, uint32_t ulRequest, void *pvValue )
 * @param pxPeripheral
 * @param ulRequest
 * @param pvValue
 * @return
 */
portBASE_TYPE FreeRTOS_UART_ioctl( Peripheral_Descriptor_t pxPeripheral, uint32_t ulRequest, void *pvValue )
{
	Peripheral_Control_t * const pxPeripheralControl = ( Peripheral_Control_t * ) pxPeripheral;
	sciBASE_t * const pxUART = ( sciBASE_t * ) diGET_PERIPHERAL_BASE_ADDRESS( ( ( Peripheral_Control_t * ) pxPeripheral ) );
	const int8_t cPeripheralNumber = diGET_PERIPHERAL_NUMBER( ( ( Peripheral_Control_t * ) pxPeripheral ) );
	portBASE_TYPE xReturn = pdPASS;
	uint32_t ulValue = ( uint32_t ) pvValue;

	//taskENTER_CRITICAL();
	{
		switch( ulRequest )
		{
			case ioctlUSE_INTERRUPTS :

				if( ulValue == pdFALSE )
				{
					sciDisableNotification(pxUART, SCI_TX_INT);
					sciDisableNotification(pxUART, SCI_RX_INT);
				}
				else
				{
					/* Enable the Rx and Tx interrupt. */
					sciEnableNotification(pxUART, SCI_TX_INT);
					sciEnableNotification(pxUART, SCI_RX_INT);

					/* If the Rx is configured to use interrupts, remember the
					transfer control structure that should be used.  A reference
					to the Tx transfer control structure is taken when a write()
					operation is actually performed. */
					pxUartRxTransferControlStructs[ cPeripheralNumber ] = pxPeripheralControl->pxRxControl;
				}
				break;

			case ioctlSET_SPEED :

				/* Set up the default UART configuration. */
				sciSetBaudrate(pxUART, (int)pvValue);
				break;

			case ioctlSET_INTERRUPT_PRIORITY :

				/* The ISR uses ISR safe FreeRTOS API functions, so the priority
				being set must be lower than (ie numerically larger than)
				configMAX_LIBRARY_INTERRUPT_PRIORITY. */
				configASSERT( ulValue >= configMAX_LIBRARY_INTERRUPT_PRIORITY );
				configASSERT( xFreeRTOSsciSetInterruptPriority( pxUART, (uint8_t)ulValue ) );
				break;

			case ioctlUSE_ZERO_COPY_TX_DMA :

				#if ioconfigUSE_UART_ZERO_COPY_TX_DMA == 1
				configASSERT( xFreeRTOSsciCommand( pxUART, SCI_ENABLE_TX_DMA_MODE ));
				configASSERT( ulValue <= maxNumberOfDMAChannels );

				/* Note: ulValue holds the DMA channel value. */

				/* Enable DMA */
				dmaEnable();

