autocore-ai/pcu_mcu_hal/LaunchPad_FreeRTOS_g/FreeRTOS-Plus-IO/Device/tms570ls20x31x/source/tms570ls20x31x_uart.c
				/* Enable Interrupt after reception of data */
				// TODO: Eltérés a 20x31x és a 4357 eszközök API-ja között
				//dmaEnableInterrupt(ulValue, BTC);
				dmaEnableInterrupt((dmaChannel_t)ulValue, BTC, DMA_INTA);

				if(pxUART == sciREG4)
				{
					/* Assigning DMA xDMAChannel with request line-29  - TX*/
					dmaReqAssign((dmaChannel_t)ulValue,(dmaRequest_t)29);
					xUartTX_DMA_Channels[0]=ulValue;
				}
				else if(pxUART == sciREG3)
				{
					/* Assigning DMA xDMAChannel with request line-21  - TX*/
					dmaReqAssign((dmaChannel_t)ulValue,(dmaRequest_t)21);
					xUartTX_DMA_Channels[1]=ulValue;
				}
				else
				{
					/* Invalid sciREG */
					configASSERT(0);
				}
				break;
				#else
				configASSERT(0);
				#endif /* ioconfigUSE_UART_ZERO_COPY_TX_DMA */

			default :

				xReturn = pdFAIL;
				break;
		}
	}
	//taskEXIT_CRITICAL();

	return xReturn;
}
/*-----------------------------------------------------------*/

/**
 * @fn portBASE_TYPE xFreeRTOSsciInit(sciBASE_t *sci)
 * @brief Switch peripherial API from HALCoGen compatibility mode to FreeRTOS-Plus-IO mode.
 * @param sci - sci module base address
 * @return success
 * @note Needs PRIVILEGED MODE
 */
// TODO megírni processzor függetlenre
#if defined(_CPU_TMS570LS20216_) || defined(_CPU_TMS570LS4357_)
portBASE_TYPE xFreeRTOSsciInit(sciBASE_t *sci)
{
	portBASE_TYPE xReturn=pdTRUE;
	if(sci == sciREG4)
	{
		vimRAM->ISR[117] = &vFreeRTOSsci4Interrupt;
		vimRAM->ISR[120] = &vFreeRTOSsci4Interrupt;
	}
	else if(sci == sciREG3)
	{
		vimRAM->ISR[63] = &vFreeRTOSsci3Interrupt;
		vimRAM->ISR[73] = &vFreeRTOSsci3Interrupt;
	}
	else
	    xReturn=pdFALSE;
	return xReturn;
}
#endif

#ifdef _CPU_TMS570LS3137_
portBASE_TYPE xFreeRTOSsciInit(sciBASE_t *sci)
{
	portBASE_TYPE xReturn=pdTRUE;
	if(sci == sciREG1)		// LIN
	{
		vimRAM->ISR[16] = &vFreeRTOSsci4Interrupt;
		vimRAM->ISR[28] = &vFreeRTOSsci4Interrupt;
	}
	else if(sci == sciREG2)	// SCI
	{
		vimRAM->ISR[65] = &vFreeRTOSsci3Interrupt;
		vimRAM->ISR[75] = &vFreeRTOSsci3Interrupt;
	}
	else xReturn=pdFALSE;
	return xReturn;
}
#endif

/*-----------------------------------------------------------*/

/**
 * @fn portBASE_TYPE xFreeRTOSsciSetInterruptPriority(sciBASE_t *sci, uint8_t priority)
 * @brief Set SCIx interrupt priority.
 * @param[in] sci - sci module base address
 * @param[in] priority - interrupt priority (0-maxNumericalIrqPriorit)
 * @return success
 * @note Needs PRIVILEGED MODE
 */
portBASE_TYPE xFreeRTOSsciSetInterruptPriority(sciBASE_t *sci, uint8_t priority)
{
	portBASE_TYPE xReturn=pdFALSE;
	uint32_t xTemp;
	if(priority <= maxNumericalIrqPriority)
	{
		if(sci == sciREG4)
		{
			/* Set SCI1 high priority (ISR[117]) interrupt priority. */

			xTemp = vimREG->CHANCTRL[29];
			xTemp &= 0xff00ffff;
			xTemp |= (priority << 16);
			vimREG->CHANCTRL[29] = xTemp;

		    /* Set SCI1 low priority (ISR[120]) interrupt priority. */

			xTemp = vimREG->CHANCTRL[30];
			xTemp &= 0x00ffffff;
			xTemp |= (priority << 24);
			vimREG->CHANCTRL[30] = xTemp;

			xReturn=pdTRUE;
		}
		else if(sci == sciREG3)
		{
			/* Set SCI2 high priority (ISR[63]) interrupt priority. */
			xTemp = vimREG->CHANCTRL[15];
			xTemp &= 0xffffff00;
			xTemp |= (priority << 0);
			vimREG->CHANCTRL[15] = xTemp;

			/* Set SCI2 low priority (ISR[73]) interrupt priority. */
			xTemp = vimREG->CHANCTRL[18];
			xTemp &= 0xff00ffff;
			xTemp |= (priority << 16 );
			vimREG->CHANCTRL[18] = xTemp;
			xReturn=pdTRUE;
		}
	}
	return xReturn;
}
/*-----------------------------------------------------------*/

/**
* @fn void vFreeRTOSsci1Interrupt(void)
* @brief High Level Interrupt for SCI1 in FreeRTOS-Plus-IO compatibility mode
*/
#pragma INTERRUPT(vFreeRTOSsci4Interrupt, IRQ)
void vFreeRTOSsci4Interrupt(void)
{
	portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
	Transfer_Control_t *pxTransferStruct;
	Zero_Copy_Tx_State_t *pxZeroCopyState;
	uint32_t ulReceived;
	const unsigned portBASE_TYPE uxUARTNumber = 0UL;

	uint32 vec = sciREG4->INTVECT0;
	switch (vec)
	{
	    case 1:					// SCI_WAKE_INT
	    case 3:					// SCI_PE_INT
	    case 6:					// SCI_FE_INT
	    case 7:					// SCI_BREAK_INT
	    case 9:					// SCI_OE_INT
	    	configASSERT(0);	// Nem kezelt megszakítás forrás hibajelzése..
	    //break;
	case 11:					// Receive
		// pxUartRxTransferControlStructs[]-ba el van mentve az SCI1 rx Transfer_Control_t struktúrája.
		pxTransferStruct = pxUartRxTransferControlStructs[uxUARTNumber];
		if( pxTransferStruct != NULL )
		{
			switch(diGET_TRANSFER_TYPE_FROM_CONTROL_STRUCT( pxTransferStruct ))
			{
				case ioctlUSE_CHARACTER_QUEUE_RX:
					#if ioconfigUSE_UART_RX_CHAR_QUEUE == 1
					{
						ioutilsRX_CHARS_INTO_QUEUE_FROM_ISR
							(
							pxTransferStruct,
							sciIsRxReady(sciREG4),
							sciREG4->RD,
							ulReceived,
							xHigherPriorityTaskWoken
							);
					}
					#else
					configASSERT(0);
					#endif 	/* ioconfigUSE_UART_RX_CHAR_QUEUE */
				break;
				case ioctlUSE_CIRCULAR_BUFFER_RX:
					#if ioconfigUSE_UART_CIRCULAR_BUFFER_RX == 1
					{
						ioutilsRX_CHARS_INTO_CIRCULAR_BUFFER_FROM_ISR
							(
							pxTransferStruct, 		/* The structure that contains the reference to the circular buffer. */
							sciIsRxReady(sciREG4), 	/* While loop condition. */
							sciREG4->RD,			/* Register holding the received character. */
							ulReceived,
							xHigherPriorityTaskWoken
							);
					}
					#else
					configASSERT(0);
					#endif /* ioconfigUSE_UART_CIRCULAR_BUFFER_RX */
				break;
				default :
					/* This must be an error.  Force an assert. */
					configASSERT( xHigherPriorityTaskWoken );
					break;
			}
		}
		break;

	case 12:					// Transmit
		pxTransferStruct = pxUartTxTransferControlStructs[uxUARTNumber];
		if(pxTransferStruct!=NULL)
		{
			switch( diGET_TRANSFER_TYPE_FROM_CONTROL_STRUCT( pxTransferStruct ) )
			{
			case ioctlUSE_ZERO_COPY_TX_DMA:
				#if ioconfigUSE_UART_ZERO_COPY_TX_DMA == 1
				{
					pxTransferStruct = pxUartTxTransferControlStructs[uxUARTNumber];
					pxZeroCopyState = ( Zero_Copy_Tx_State_t * ) ( pxTransferStruct )->pvTransferState;
					xSemaphoreGiveFromISR( pxZeroCopyState->xWriteAccessMutex, &( xHigherPriorityTaskWoken ) );
					sciREG4->CLRINT = SCI_TX_INT;
				}
				#else
				configASSERT(0);
				#endif  /* ioconfigUSE_UART_ZERO_COPY_TX_DMA */

