autocore-ai/pcu_mcu_hal/LaunchPad_FreeRTOS_g/FreeRTOS-Plus-IO/Device/tms570ls20x31x/source/tms570ls20x31x_uart.c
			case ioctlUSE_ZERO_COPY_TX:
					#if ioconfigUSE_UART_ZERO_COPY_TX == 1
					pxZeroCopyState = ( Zero_Copy_Tx_State_t * ) ( pxTransferStruct )->pvTransferState;
					if(pxZeroCopyState->usBufferLength != 0U)
					{
						sciREG4->TD = pxZeroCopyState->pucBufferStart[0];
						(pxZeroCopyState->pucBufferStart)++;
						pxZeroCopyState->usBufferLength--;
					}
					else
						{
						sciREG4->CLRINT = SCI_TX_INT;
						xSemaphoreGiveFromISR( pxZeroCopyState->xWriteAccessMutex, &( xHigherPriorityTaskWoken ) );
						}
					#else
						configASSERT(0);
					#endif  /* ioconfigUSE_UART_ZERO_COPY_TX */
				break;

				case ioctlUSE_CHARACTER_QUEUE_TX:
					#if ioconfigUSE_UART_TX_CHAR_QUEUE == 1
					{
						Character_Queue_State_t *pxCharQueueState = ( Character_Queue_State_t * ) ( ( pxTransferStruct )->pvTransferState );
						if(uxQueueMessagesWaitingFromISR( pxCharQueueState->xQueue ))
						{
							ioutilsTX_CHARS_FROM_QUEUE_FROM_ISR
								(
								pxTransferStruct,
								( sciREG4->FLR & SCI_TX_INT ),
								( sciREG4->TD = ucChar ),
								xHigherPriorityTaskWoken
								);
						}
						else
						{
							sciREG4->CLRINT = SCI_TX_INT;
						}

					}
					#else
					configASSERT(0);
					#endif /* ioconfigUSE_UART_TX_CHAR_QUEUE */
				break;
				default :
					/* This must be an error.  Force an assert. */
					configASSERT( xHigherPriorityTaskWoken );
					break;
			}
		}
		break;

	default:	/* phantom interrupt, clear flags and return */
		sciREG4->FLR = ~sciREG4->SETINTLVL & 0x07000303U;
	}
	portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
}
/*-----------------------------------------------------------*/

/** @fn void vFreeRTOSsci2Interrupt(void)
*   @brief High Level Interrupt for SCI2 in FreeRTOS-Plus-IO compatibility mode
*/
#pragma INTERRUPT(vFreeRTOSsci3Interrupt, IRQ)
void vFreeRTOSsci3Interrupt(void)
{
	portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
	Transfer_Control_t *pxTransferStruct;
	Zero_Copy_Tx_State_t *pxZeroCopyState;
	uint32_t ulReceived;
	const unsigned portBASE_TYPE uxUARTNumber = 1UL;

	uint32 vec = sciREG3->INTVECT0;
	switch (vec)
	{
	    case 1:					// SCI_WAKE_INT
	    case 3:					// SCI_PE_INT
	    case 6:					// SCI_FE_INT
	    case 7:					// SCI_BREAK_INT
	    case 9:					// SCI_OE_INT
	    	configASSERT(0);	// Nem kezelt megszakítás forrás hibajelzése..
	    //break;
	case 11:					// Receive
		// pxUartRxTransferControlStructs[]-ba el van mentve az SCI1 rx Transfer_Control_t struktúrája.
		pxTransferStruct = pxUartRxTransferControlStructs[uxUARTNumber];
		if( pxTransferStruct != NULL )
		{
			switch(diGET_TRANSFER_TYPE_FROM_CONTROL_STRUCT( pxTransferStruct ))
			{
				case ioctlUSE_CHARACTER_QUEUE_RX:
					#if ioconfigUSE_UART_RX_CHAR_QUEUE == 1
					{
						ioutilsRX_CHARS_INTO_QUEUE_FROM_ISR
							(
							pxTransferStruct,
							sciIsRxReady(sciREG3),
							sciREG3->RD,
							ulReceived,
							xHigherPriorityTaskWoken
							);
					}
					#else
					configASSERT(0);
					#endif 	/* ioconfigUSE_UART_RX_CHAR_QUEUE */
				break;
				case ioctlUSE_CIRCULAR_BUFFER_RX:
					#if ioconfigUSE_UART_CIRCULAR_BUFFER_RX == 1
					{
						ioutilsRX_CHARS_INTO_CIRCULAR_BUFFER_FROM_ISR
							(
							pxTransferStruct, 		/* The structure that contains the reference to the circular buffer. */
							sciIsRxReady(sciREG3), 	/* While loop condition. */
							sciREG3->RD,			/* Register holding the received character. */
							ulReceived,
							xHigherPriorityTaskWoken
							);
					}
					#else
					configASSERT(0);
					#endif /* ioconfigUSE_UART_CIRCULAR_BUFFER_RX */
				break;
				default :
					/* This must be an error.  Force an assert. */
					configASSERT( xHigherPriorityTaskWoken );
					break;
			}
		}
		break;

	case 12:					// Transmit
		pxTransferStruct = pxUartTxTransferControlStructs[uxUARTNumber];
		if(pxTransferStruct!=NULL)
		{
			switch( diGET_TRANSFER_TYPE_FROM_CONTROL_STRUCT( pxTransferStruct ) )
			{
			case ioctlUSE_ZERO_COPY_TX_DMA:
				#if ioconfigUSE_UART_ZERO_COPY_TX_DMA == 1
				{
					pxTransferStruct = pxUartTxTransferControlStructs[uxUARTNumber];
					pxZeroCopyState = ( Zero_Copy_Tx_State_t * ) ( pxTransferStruct )->pvTransferState;
					xSemaphoreGiveFromISR( pxZeroCopyState->xWriteAccessMutex, &( xHigherPriorityTaskWoken ) );
					sciREG3->CLRINT = SCI_TX_INT;
				}
				#else
				configASSERT(0);
				#endif  /* ioconfigUSE_UART_ZERO_COPY_TX_DMA */
			break;

				case ioctlUSE_ZERO_COPY_TX:
					#if ioconfigUSE_UART_ZERO_COPY_TX == 1
					pxZeroCopyState = ( Zero_Copy_Tx_State_t * ) ( pxTransferStruct )->pvTransferState;
					if(pxZeroCopyState->usBufferLength != 0U)
					{
						sciREG3->TD = pxZeroCopyState->pucBufferStart[0];
						(pxZeroCopyState->pucBufferStart)++;
						pxZeroCopyState->usBufferLength--;
					}
					else
						{
						sciREG3->CLRINT = SCI_TX_INT;
						xSemaphoreGiveFromISR( pxZeroCopyState->xWriteAccessMutex, &( xHigherPriorityTaskWoken ) );
						}
					#else
					configASSERT(0);
					#endif  /* ioconfigUSE_UART_ZERO_COPY_TX */
				break;

				case ioctlUSE_CHARACTER_QUEUE_TX:
					#if ioconfigUSE_UART_TX_CHAR_QUEUE == 1
					{
						Character_Queue_State_t *pxCharQueueState = ( Character_Queue_State_t * ) ( ( pxTransferStruct )->pvTransferState );
						if(uxQueueMessagesWaitingFromISR( pxCharQueueState->xQueue ))
						{
							ioutilsTX_CHARS_FROM_QUEUE_FROM_ISR
								(
								pxTransferStruct,
								( sciREG3->FLR & SCI_TX_INT ),
								( sciREG3->TD = ucChar ),
								xHigherPriorityTaskWoken
								);
						}
						else
						{
							sciREG3->CLRINT = SCI_TX_INT;
						}
					}
					#else
					configASSERT(0);
					#endif /* ioconfigUSE_UART_TX_CHAR_QUEUE */
				break;
				default :
					/* This must be an error.  Force an assert. */
					configASSERT( xHigherPriorityTaskWoken );
					break;
			}
		}
		break;

	default:	/* phantom interrupt, clear flags and return */
		sciREG3->FLR = ~sciREG3->SETINTLVL & 0x07000303U;
	}
	portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
}
/*-----------------------------------------------------------*/

/**
 * @fn portBASE_TYPE xFreeRTOSsciCommand(sciBASE_t *sci, sciCommand_t command )
 * @param[in] sci - sci module base address
 * @param[in] command
 * @return success
 */
portBASE_TYPE xFreeRTOSsciCommand(sciBASE_t *sci, sciCommand_t command )
{
	portBASE_TYPE xReturn=pdTRUE;

	if(sci == sciREG4 || sci == sciREG3)
	{
		switch(command)
		{
			case SCI_ENABLE_TX:
				sci->GCR1|=(1U<<25U);
				break;
			case SCI_DISABLE_TX:
				sci->GCR1&=0xffffffff-(1U<<25U);
				break;
			case SCI_ENABLE_MULTI_BUFFER_MODE:
				sci->GCR1|=(1U<<10U);
				break;
			case SCI_DISABLE_MULTI_BUFFER_MODE:
				sci->GCR1&=0xffffffff-(1U<<10U);
				break;
			case SCI_ENABLE_TX_DMA_MODE:
				sci->SETINT=(1U<<16U);
				break;
			case SCI_DISABLE_TX_DMA_MODE:
				sci->CLRINT=(1U<<16U);
				break;
			case SCI_ENABLE_RX_DMA_MODE:
				sci->SETINT=(1U<<17U);
				break;
			case SCI_DISABLE_RX_DMA_MODE:
				sci->CLRINT=(1U<<17U);
				break;
				// ide még jöhetnek a további parancsok...
			default:
				xReturn=pdFALSE;
		}
	}
	return xReturn;
}
/*-----------------------------------------------------------*/
